main.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-12 Tue 18:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sebastian Halbig</title>
<meta name="author" content="Sebastian Halbig" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Sebastian Halbig</h1>
<div id="outline-container-orga75d0cc" class="outline-2">
<h2 id="orga75d0cc"><span class="section-number-2">1.</span> About me</h2>
<div class="outline-text-2" id="text-1">
<p>
Currently, I am a research assistant in the team of <a href="https://www.uni-marburg.de/en/fb12/research-groups/algeblie">Istvan Heckenberger</a> at the Philipps-Universität Marburg. Prior to that, I was a PhD student of <a href="https://tu-dresden.de/mn/math/geometrie/kraehmer/startseite">Ulrich Krähmer</a> at the TU Dresden.
</p>

<p>
My research lives at the intersection of three areas:
</p>
<ul class="org-ul">
<li>Hopf algebras and their representation theory,</li>
<li>the theory of monoidal categories in its various flavours, and (to a lesser extend)</li>
<li>low-dimensional topology.</li>
</ul>

<p>
You can reach me via mail: <a href="mailto:Sebastian.Halbig@uni-marburg.de">Sebastian.Halbig@uni-marburg.de</a>
</p>
</div>
</div>
<div id="outline-container-orgf6ac896" class="outline-2">
<h2 id="orgf6ac896"><span class="section-number-2">2.</span> Publications</h2>
<div class="outline-text-2" id="text-2">
<p>
Preprints of articles by my coauthors and me can be found on the <a href="https://arxiv.org/search/?query=Halbig%2C+Sebastian&amp;searchtype=author&amp;abstracts=show&amp;order=-announced_date_first&amp;size=50">arXiv</a>.
Reviews and an overview of all published articles are on <a href="https://zbmath.org/authors/halbig.sebastian">zbMATH</a>.
</p>
</div>
<div id="outline-container-org769ff22" class="outline-3">
<h3 id="org769ff22"><span class="section-number-3">2.1.</span> Preprints</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>S. Halbig and T.Zorman. <span class="meek">Duality in Monoidal Categories</span>. (2024).</li>
<li>S. Halbig and T.Zorman. <span class="meek">Diagrammatics for Comodule Monads</span>. (2023).</li>
<li>B. Femić and S. Halbig. <span class="meek">Categorical centers and Yetter–Drinfel`d-modules as 2-categorical (bi)lax structures</span>. (2023).</li>
</ol>
</div>
</div>
<div id="outline-container-org62ca7b0" class="outline-3">
<h3 id="org62ca7b0"><span class="section-number-3">2.2.</span> Published articles</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>S. Halbig and T.Zorman. <span class="meek">Pivotality, twisted centres and the anti-double of a Hopf monad</span>. Theory Appl. Categ. (2024).</li>
<li>S. Halbig. <span class="meek">Generalised Taft algebras and pairs in involution</span>. Commun. Algebra. (2021).</li>
<li>S. Halbig and U. Krähmer <span class="meek">A Hopf algebra without a modular pair in involution</span>. Geom. Methods in Physics XXXVII. (2019).</li>
</ol>
</div>
</div>
<div id="outline-container-orga3b587e" class="outline-3">
<h3 id="orga3b587e"><span class="section-number-3">2.3.</span> Other publications</h3>
<div class="outline-text-3" id="text-2-3">
<p>
A digital version of my PhD thesis can be found <a href="https://tud.qucosa.de/api/qucosa%3A80342/attachment/ATT-0/">here</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-org5200e9e" class="outline-2">
<h2 id="org5200e9e"><span class="section-number-2">3.</span> Conferences, talks and research visits</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org41fd7c1" class="outline-3">
<h3 id="org41fd7c1"><span class="section-number-3">3.1.</span> 2024</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>29.04. - 03.05.2024 Research visit in <i>Bonn</i></li>
<li>26.02. - 27.02.2024 Research visit in <i>Dresden</i></li>
<li>19.02.2024 - 23.05.2024 Research visit in <i>Brno</i>
<ul class="org-ul">
<li>21.02.2024 Talk in the <i>Brno Algebra seminar:</i>  "Dualities in monoidal functor categories"</li>
</ul></li>
<li>28.01. - 02.02.2024 <i>Oberwolfach Mini-workshop:</i> "Bridging Number Theory and Nichols Algebras via Deformations"
<ul class="org-ul">
<li>02.02.2024 Talk: "Dualities in abelian monoidal functor categories"</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0c3ac57" class="outline-3">
<h3 id="org0c3ac57"><span class="section-number-3">3.2.</span> 2023</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>23.11. - 26.11.2023 <i>Factorisation homology seminar</i> in Dresden
<ul class="org-ul">
<li>Talks on the 24.11 and the 25.11</li>
</ul></li>
<li>20.10. - 22.10.2023 <i>Factorisation homology seminar</i> in Bonn</li>
<li>04.09. - 06.09.2023 <i>Hopf days</i> in Brussels
<ul class="org-ul">
<li>04.09 Talk "Duality in monoidal categories"</li>
</ul></li>
<li>14.07. - 15.07.2023 Seminar on <i>Mackey functors</i> co-organised with T. Zorman</li>
<li>02.07. - 08.07.2023 <i>Category Theory 2023</i> in Louvain-la-Neuve</li>
<li>22.05. - 26.05.2023 Workshop <i>Hopf Algebras and Tensor Categories</i> in Marburg
<ul class="org-ul">
<li>23.05 Talk " Pairs in involution – From Hopf algebras to monoidal categories and back"</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgac59503" class="outline-3">
<h3 id="orgac59503"><span class="section-number-3">3.3.</span> 2022</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>08.12. - 11.12.2022 Seminar on <i>Operads</i> in Bonn</li>
<li>05.12. - 08.12.2022 Research visit in <i>Erlangen</i></li>
<li>30.05.2022 <i>Quantum groups seminar</i>
"Pivotality, twisted centres and the anti-double of a Hopf monad"</li>
<li>15.05.2022 <i>PSSL Brno</i>
"Pivotality, twisted centres and the anti-double of a Hopf monad"</li>
<li>12.05.2022 <i>Czech academy of sciences in Prague</i>
"Pivotality, twisted centres and the anti-double of a Hopf monad"</li>
<li>12.04.2022 <i>Universität Hamburg</i>
"Pivotality, twisted centres and the anti-double of a Hopf monad"</li>
</ul>
</div>
</div>
<div id="outline-container-orgf04d527" class="outline-3">
<h3 id="orgf04d527"><span class="section-number-3">3.4.</span> 2021</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>09.12.2021 <i>Czech academy of sciences in Prague</i>
"Exploring the Kitaev lattice model"</li>
<li>28.01.2021 <i>Promotionen und Postdocs in Darstellungstheorie (online)</i>
"Generalised Taft algebras and pairs in involution"</li>
</ul>
</div>
</div>
<div id="outline-container-org2ff7adc" class="outline-3">
<h3 id="org2ff7adc"><span class="section-number-3">3.5.</span> 2020</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>09.11.2020 <i>Geometric methods seminar Dresden</i>
"Reconstruction of fusion categories"</li>
<li>20.01.2020 <i>RWTH Aachen</i>
"Generalised Taft algebras and pairs in involution"</li>
</ul>
</div>
</div>
<div id="outline-container-org171b450" class="outline-3">
<h3 id="org171b450"><span class="section-number-3">3.6.</span> 2019</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li>16.12.2019 <i>Friedrich–Alexander University Erlangen</i>
"Generalised Taft algebras and pairs in involution"</li>
<li>30.09.2019 <i>Univerité Blaise–Pascal Clermont–Ferrand</i>
"Generalised Taft algebras and pairs in involution"</li>
<li>08.07.2019 <i>Phillips–Universität Marburg</i>
"Generalised Taft algebras and pairs in involution"</li>
</ul>
</div>
</div>
<div id="outline-container-org87ec73c" class="outline-3">
<h3 id="org87ec73c"><span class="section-number-3">3.7.</span> 2018</h3>
<div class="outline-text-3" id="text-3-7">
<ul class="org-ul">
<li>19.11.2018 <i>Institute of mathematics of the Polish academy of sciences</i>
"Generalised Taft algebras and pairs in involution"</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8612e6f" class="outline-2">
<h2 id="org8612e6f"><span class="section-number-2">4.</span> Teaching</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org9f0ffc7" class="outline-3">
<h3 id="org9f0ffc7"><span class="section-number-3">4.1.</span> 2024</h3>
<div class="outline-text-3" id="text-4-1">
<p>
summer term: Representation theory of finite groups (lecturer)
</p>
</div>
</div>
<div id="outline-container-org0e54fea" class="outline-3">
<h3 id="org0e54fea"><span class="section-number-3">4.2.</span> 2023</h3>
<div class="outline-text-3" id="text-4-2">
<p>
winter term: Basic concepts of linear algebra (teaching assistant),
             Algebra (teaching assitant)
</p>

<p>
summer term: Representation theory of algebras (teaching assistant),
             linear algebra II (teaching assistang)
</p>
</div>
</div>
<div id="outline-container-org54e9f42" class="outline-3">
<h3 id="org54e9f42"><span class="section-number-3">4.3.</span> 2022</h3>
<div class="outline-text-3" id="text-4-3">
<p>
winter term: linear algebra (teaching assisstant)
</p>

<p>
summer term: geometry for civil engineers (tutor)
</p>
</div>
</div>
<div id="outline-container-orgf1d4b9b" class="outline-3">
<h3 id="orgf1d4b9b"><span class="section-number-3">4.4.</span> 2021</h3>
<div class="outline-text-3" id="text-4-4">
<p>
winter term: mathematics for industrial engineers (teaching assistant)
</p>

<p>
summer term: linear algebra for teachers (tutors)
</p>
</div>
</div>
<div id="outline-container-org6186462" class="outline-3">
<h3 id="org6186462"><span class="section-number-3">4.5.</span> 2020</h3>
<div class="outline-text-3" id="text-4-5">
<p>
winter term: linear algebra (tutor)
</p>

<p>
summer term: Galois theory (teaching assistant)
</p>
</div>
</div>
<div id="outline-container-orgd5f2d41" class="outline-3">
<h3 id="orgd5f2d41"><span class="section-number-3">4.6.</span> 2019</h3>
<div class="outline-text-3" id="text-4-6">
<p>
winter term: mathematics for industrial engineers (tutor)
</p>

<p>
summer term: mathematics for engineers (tutor)
</p>
</div>
</div>
<div id="outline-container-org89236ab" class="outline-3">
<h3 id="org89236ab"><span class="section-number-3">4.7.</span> 2018</h3>
<div class="outline-text-3" id="text-4-7">
<p>
winter term: mathematics for industrial engineers (tutor)
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sebastian Halbig</p>
<p class="date">Created: 2024-03-12 Tue 18:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
